---
kind: type
id: T:Autodesk.Revit.DB.LinkLoadResult
source: html/f846bfb0-b047-9332-567f-75ae880d8359.htm
---
# Autodesk.Revit.DB.LinkLoadResult

This class stores the results of trying to load a single linked model.

## Syntax (C#)
```csharp
public class LinkLoadResult : IDisposable
```